Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/atdf/PIC32MM0256GPM064.atdf
         <register caption="" name="CCP7CON3" offset="0x620" rw="RW" size="4">
            <bitfield caption="" mask="0x000C0000" name="PSSACE" values="CCP7CON3__PSSACE"/>
            <bitfield caption="" mask="0x00200000" name="POLACE" values="CCP7CON3_POLACE"/>
            <bitfield caption="" mask="0x70000000" name="OSCNT" />
            <bitfield caption="" mask="0x80000000" name="OETRIG" />
         </register>
         <register caption="" name="CCP8CON3" offset="0x720" rw="RW" size="4">
            <bitfield caption="" mask="0x000C0000" name="PSSACE" values="CCP8CON3__PSSACE"/>
            <bitfield caption="" mask="0x00200000" name="POLACE" values="CCP8CON3_POLACE"/>
            <bitfield caption="" mask="0x70000000" name="OSCNT" />
            <bitfield caption="" mask="0x80000000" name="OETRIG" />
         </register>
         <register caption="" name="CCP9CON3" offset="0x820" rw="RW" size="4">
            <bitfield caption="" mask="0x000C0000" name="PSSACE" values="CCP9CON3__PSSACE"/>
            <bitfield caption="" mask="0x00200000" name="POLACE" values="CCP9CON3_POLACE"/>
            <bitfield caption="" mask="0x70000000" name="OSCNT" />
            <bitfield caption="" mask="0x80000000" name="OETRIG" />
         </register>
         <register caption="" name="CCP1STAT" offset="0x30" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ICBNE" />
            <bitfield caption="" mask="0x00000002" name="ICOV" />
            <bitfield caption="" mask="0x00000004" name="ICDIS" />
            <bitfield caption="" mask="0x00000008" name="SCEVT" />
            <bitfield caption="" mask="0x00000010" name="ASEVT" />
            <bitfield caption="" mask="0x00000020" name="TRCLR" />
            <bitfield caption="" mask="0x00000040" name="TRSET" />
            <bitfield caption="" mask="0x00000080" name="CCPTRIG" />
            <bitfield caption="" mask="0x00000400" name="ICGARM" />
            <bitfield caption="" mask="0x00010000" name="RAWIP" />
            <bitfield caption="" mask="0x00020000" name="RBWIP" />
            <bitfield caption="" mask="0x00040000" name="TMRLWIP" />
            <bitfield caption="" mask="0x00080000" name="TMRHWIP" />
            <bitfield caption="" mask="0x00100000" name="PRLWIP" />
         </register>
         <register caption="" name="CCP2STAT" offset="0x130" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ICBNE" />
            <bitfield caption="" mask="0x00000002" name="ICOV" />
            <bitfield caption="" mask="0x00000004" name="ICDIS" />
            <bitfield caption="" mask="0x00000008" name="SCEVT" />
            <bitfield caption="" mask="0x00000010" name="ASEVT" />
            <bitfield caption="" mask="0x00000020" name="TRCLR" />
            <bitfield caption="" mask="0x00000040" name="TRSET" />
            <bitfield caption="" mask="0x00000080" name="CCPTRIG" />
            <bitfield caption="" mask="0x00000400" name="ICGARM" />
            <bitfield caption="" mask="0x00010000" name="RAWIP" />
            <bitfield caption="" mask="0x00020000" name="RBWIP" />
            <bitfield caption="" mask="0x00040000" name="TMRLWIP" />
            <bitfield caption="" mask="0x00080000" name="TMRHWIP" />
            <bitfield caption="" mask="0x00100000" name="PRLWIP" />
         </register>
         <register caption="" name="CCP3STAT" offset="0x230" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ICBNE" />
            <bitfield caption="" mask="0x00000002" name="ICOV" />
            <bitfield caption="" mask="0x00000004" name="ICDIS" />
            <bitfield caption="" mask="0x00000008" name="SCEVT" />
            <bitfield caption="" mask="0x00000010" name="ASEVT" />
            <bitfield caption="" mask="0x00000020" name="TRCLR" />
            <bitfield caption="" mask="0x00000040" name="TRSET" />
            <bitfield caption="" mask="0x00000080" name="CCPTRIG" />
            <bitfield caption="" mask="0x00000400" name="ICGARM" />
            <bitfield caption="" mask="0x00010000" name="RAWIP" />
            <bitfield caption="" mask="0x00020000" name="RBWIP" />
            <bitfield caption="" mask="0x00040000" name="TMRLWIP" />
            <bitfield caption="" mask="0x00080000" name="TMRHWIP" />
            <bitfield caption="" mask="0x00100000" name="PRLWIP" />
         </register>
         <register caption="" name="CCP4STAT" offset="0x330" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ICBNE" />
            <bitfield caption="" mask="0x00000002" name="ICOV" />
            <bitfield caption="" mask="0x00000004" name="ICDIS" />
            <bitfield caption="" mask="0x00000008" name="SCEVT" />
            <bitfield caption="" mask="0x00000010" name="ASEVT" />
            <bitfield caption="" mask="0x00000020" name="TRCLR" />
            <bitfield caption="" mask="0x00000040" name="TRSET" />
            <bitfield caption="" mask="0x00000080" name="CCPTRIG" />
            <bitfield caption="" mask="0x00000400" name="ICGARM" />
            <bitfield caption="" mask="0x00010000" name="RAWIP" />
            <bitfield caption="" mask="0x00020000" name="RBWIP" />
            <bitfield caption="" mask="0x00040000" name="TMRLWIP" />
            <bitfield caption="" mask="0x00080000" name="TMRHWIP" />
            <bitfield caption="" mask="0x00100000" name="PRLWIP" />
         </register>
         <register caption="" name="CCP5STAT" offset="0x430" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ICBNE" />
            <bitfield caption="" mask="0x00000002" name="ICOV" />
            <bitfield caption="" mask="0x00000004" name="ICDIS" />
            <bitfield caption="" mask="0x00000008" name="SCEVT" />
            <bitfield caption="" mask="0x00000010" name="ASEVT" />
            <bitfield caption="" mask="0x00000020" name="TRCLR" />
            <bitfield caption="" mask="0x00000040" name="TRSET" />
            <bitfield caption="" mask="0x00000080" name="CCPTRIG" />
            <bitfield caption="" mask="0x00000400" name="ICGARM" />
            <bitfield caption="" mask="0x00010000" name="RAWIP" />
            <bitfield caption="" mask="0x00020000" name="RBWIP" />
            <bitfield caption="" mask="0x00040000" name="TMRLWIP" />
            <bitfield caption="" mask="0x00080000" name="TMRHWIP" />
            <bitfield caption="" mask="0x00100000" name="PRLWIP" />
         </register>
         <register caption="" name="CCP6STAT" offset="0x530" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ICBNE" />
            <bitfield caption="" mask="0x00000002" name="ICOV" />
            <bitfield caption="" mask="0x00000004" name="ICDIS" />
            <bitfield caption="" mask="0x00000008" name="SCEVT" />
            <bitfield caption="" mask="0x00000010" name="ASEVT" />
            <bitfield caption="" mask="0x00000020" name="TRCLR" />
            <bitfield caption="" mask="0x00000040" name="TRSET" />
            <bitfield caption="" mask="0x00000080" name="CCPTRIG" />
            <bitfield caption="" mask="0x00000400" name="ICGARM" />
            <bitfield caption="" mask="0x00010000" name="RAWIP" />
            <bitfield caption="" mask="0x00020000" name="RBWIP" />
            <bitfield caption="" mask="0x00040000" name="TMRLWIP" />
            <bitfield caption="" mask="0x00080000" name="TMRHWIP" />
            <bitfield caption="" mask="0x00100000" name="PRLWIP" />
         </register>
         <register caption="" name="CCP7STAT" offset="0x630" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ICBNE" />
            <bitfield caption="" mask="0x00000002" name="ICOV" />
            <bitfield caption="" mask="0x00000004" name="ICDIS" />
            <bitfield caption="" mask="0x00000008" name="SCEVT" />
            <bitfield caption="" mask="0x00000010" name="ASEVT" />
            <bitfield caption="" mask="0x00000020" name="TRCLR" />
            <bitfield caption="" mask="0x00000040" name="TRSET" />
            <bitfield caption="" mask="0x00000080" name="CCPTRIG" />
            <bitfield caption="" mask="0x00000400" name="ICGARM" />
            <bitfield caption="" mask="0x00010000" name="RAWIP" />
            <bitfield caption="" mask="0x00020000" name="RBWIP" />
            <bitfield caption="" mask="0x00040000" name="TMRLWIP" />
            <bitfield caption="" mask="0x00080000" name="TMRHWIP" />
            <bitfield caption="" mask="0x00100000" name="PRLWIP" />
         </register>
         <register caption="" name="CCP8STAT" offset="0x730" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ICBNE" />
            <bitfield caption="" mask="0x00000002" name="ICOV" />
            <bitfield caption="" mask="0x00000004" name="ICDIS" />
            <bitfield caption="" mask="0x00000008" name="SCEVT" />
            <bitfield caption="" mask="0x00000010" name="ASEVT" />
            <bitfield caption="" mask="0x00000020" name="TRCLR" />
            <bitfield caption="" mask="0x00000040" name="TRSET" />
            <bitfield caption="" mask="0x00000080" name="CCPTRIG" />
            <bitfield caption="" mask="0x00000400" name="ICGARM" />
            <bitfield caption="" mask="0x00010000" name="RAWIP" />
            <bitfield caption="" mask="0x00020000" name="RBWIP" />
            <bitfield caption="" mask="0x00040000" name="TMRLWIP" />
            <bitfield caption="" mask="0x00080000" name="TMRHWIP" />
            <bitfield caption="" mask="0x00100000" name="PRLWIP" />
         </register>
         <register caption="" name="CCP9STAT" offset="0x830" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ICBNE" />
            <bitfield caption="" mask="0x00000002" name="ICOV" />
            <bitfield caption="" mask="0x00000004" name="ICDIS" />
            <bitfield caption="" mask="0x00000008" name="SCEVT" />
            <bitfield caption="" mask="0x00000010" name="ASEVT" />
            <bitfield caption="" mask="0x00000020" name="TRCLR" />
            <bitfield caption="" mask="0x00000040" name="TRSET" />
            <bitfield caption="" mask="0x00000080" name="CCPTRIG" />
            <bitfield caption="" mask="0x00000400" name="ICGARM" />
            <bitfield caption="" mask="0x00010000" name="RAWIP" />
            <bitfield caption="" mask="0x00020000" name="RBWIP" />
            <bitfield caption="" mask="0x00040000" name="TMRLWIP" />
            <bitfield caption="" mask="0x00080000" name="TMRHWIP" />
            <bitfield caption="" mask="0x00100000" name="PRLWIP" />
         </register>
         <register caption="" name="CCP1TMR" offset="0x40" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="TMRL" />
            <bitfield caption="" mask="0xFFFF0000" name="TMRH" />
         </register>
         <register caption="" name="CCP2TMR" offset="0x140" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="TMRL" />
            <bitfield caption="" mask="0xFFFF0000" name="TMRH" />
         </register>
