Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/atdf/PIC32MM0256GPM064.atdf
         <register caption="" name="CNPUA" offset="0x2f0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNPUA0" />
            <bitfield caption="" mask="0x00000002" name="CNPUA1" />
            <bitfield caption="" mask="0x00000004" name="CNPUA2" />
            <bitfield caption="" mask="0x00000008" name="CNPUA3" />
            <bitfield caption="" mask="0x00000010" name="CNPUA4" />
            <bitfield caption="" mask="0x00000020" name="CNPUA5" />
            <bitfield caption="" mask="0x00000040" name="CNPUA6" />
            <bitfield caption="" mask="0x00000080" name="CNPUA7" />
            <bitfield caption="" mask="0x00000100" name="CNPUA8" />
            <bitfield caption="" mask="0x00000200" name="CNPUA9" />
            <bitfield caption="" mask="0x00000400" name="CNPUA10" />
            <bitfield caption="" mask="0x00000800" name="CNPUA11" />
            <bitfield caption="" mask="0x00001000" name="CNPUA12" />
            <bitfield caption="" mask="0x00002000" name="CNPUA13" />
            <bitfield caption="" mask="0x00004000" name="CNPUA14" />
            <bitfield caption="" mask="0x00008000" name="CNPUA15" />
         </register>
         <register caption="" name="CNPDA" offset="0x300" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNPDA0" />
            <bitfield caption="" mask="0x00000002" name="CNPDA1" />
            <bitfield caption="" mask="0x00000004" name="CNPDA2" />
            <bitfield caption="" mask="0x00000008" name="CNPDA3" />
            <bitfield caption="" mask="0x00000010" name="CNPDA4" />
            <bitfield caption="" mask="0x00000020" name="CNPDA5" />
            <bitfield caption="" mask="0x00000040" name="CNPDA6" />
            <bitfield caption="" mask="0x00000080" name="CNPDA7" />
            <bitfield caption="" mask="0x00000100" name="CNPDA8" />
            <bitfield caption="" mask="0x00000200" name="CNPD9" />
            <bitfield caption="" mask="0x00000400" name="CNPDA10" />
            <bitfield caption="" mask="0x00000800" name="CNPDA11" />
            <bitfield caption="" mask="0x00001000" name="CNPDA12" />
            <bitfield caption="" mask="0x00002000" name="CNPDA13" />
            <bitfield caption="" mask="0x00004000" name="CNPDA14" />
            <bitfield caption="" mask="0x00008000" name="CNPDA15" />
         </register>
         <register caption="" name="CNCONA" offset="0x310" rw="RW" size="4">
            <bitfield caption="" mask="0x00000400" name="PORT32" />
            <bitfield caption="" mask="0x00000800" name="CNSTYLE" />
            <bitfield caption="" mask="0x00008000" name="ON" />
         </register>
         <register caption="" name="CNEN0A" offset="0x320" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNIE0A0" />
            <bitfield caption="" mask="0x00000002" name="CNIE0A1" />
            <bitfield caption="" mask="0x00000004" name="CNIE0A2" />
            <bitfield caption="" mask="0x00000008" name="CNIE0A3" />
            <bitfield caption="" mask="0x00000010" name="CNIE0A4" />
            <bitfield caption="" mask="0x00000020" name="CNIE0A5" />
            <bitfield caption="" mask="0x00000040" name="CNIE0A6" />
            <bitfield caption="" mask="0x00000080" name="CNIE0A7" />
            <bitfield caption="" mask="0x00000100" name="CNIE0A8" />
            <bitfield caption="" mask="0x00000200" name="CNIE0A9" />
            <bitfield caption="" mask="0x00000400" name="CNIE0A10" />
            <bitfield caption="" mask="0x00000800" name="CNIE0A11" />
            <bitfield caption="" mask="0x00001000" name="CNIE0A12" />
            <bitfield caption="" mask="0x00002000" name="CNIE0A13" />
            <bitfield caption="" mask="0x00004000" name="CNIE0A14" />
            <bitfield caption="" mask="0x00008000" name="CNIE0A15" />
         </register>
         <register caption="" name="CNSTATA" offset="0x330" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNSTATA0" />
            <bitfield caption="" mask="0x00000002" name="CNSTATA1" />
            <bitfield caption="" mask="0x00000004" name="CNSTATA2" />
            <bitfield caption="" mask="0x00000008" name="CNSTATA3" />
            <bitfield caption="" mask="0x00000010" name="CNSTATA4" />
            <bitfield caption="" mask="0x00000020" name="CNSTATA5" />
            <bitfield caption="" mask="0x00000040" name="CNSTATA6" />
            <bitfield caption="" mask="0x00000080" name="CNSTATA7" />
            <bitfield caption="" mask="0x00000100" name="CNSTATA8" />
            <bitfield caption="" mask="0x00000200" name="CNSTATA9" />
            <bitfield caption="" mask="0x00000400" name="CNSTATA10" />
            <bitfield caption="" mask="0x00000800" name="CNSTATA11" />
            <bitfield caption="" mask="0x00001000" name="CNSTATA12" />
            <bitfield caption="" mask="0x00002000" name="CNSTATA13" />
            <bitfield caption="" mask="0x00004000" name="CNSTATA14" />
            <bitfield caption="" mask="0x00008000" name="CNSTATA15" />
         </register>
         <register caption="" name="CNEN1A" offset="0x340" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNIE1A0" />
            <bitfield caption="" mask="0x00000002" name="CNIE1A1" />
            <bitfield caption="" mask="0x00000004" name="CNIE1A2" />
            <bitfield caption="" mask="0x00000008" name="CNIE1A3" />
            <bitfield caption="" mask="0x00000010" name="CNIE1A4" />
            <bitfield caption="" mask="0x00000020" name="CNIE1A5" />
            <bitfield caption="" mask="0x00000040" name="CNIE1A6" />
            <bitfield caption="" mask="0x00000080" name="CNIE1A7" />
            <bitfield caption="" mask="0x00000100" name="CNIE1A8" />
            <bitfield caption="" mask="0x00000200" name="CNIE1A9" />
            <bitfield caption="" mask="0x00000400" name="CNIE1A10" />
            <bitfield caption="" mask="0x00000800" name="CNIE1A11" />
            <bitfield caption="" mask="0x00001000" name="CNIE1A12" />
            <bitfield caption="" mask="0x00002000" name="CNIE1A13" />
            <bitfield caption="" mask="0x00004000" name="CNIE1A14" />
            <bitfield caption="" mask="0x00008000" name="CNIE1A15" />
         </register>
         <register caption="" name="CNFA" offset="0x350" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNFA0" />
            <bitfield caption="" mask="0x00000002" name="CNFA1" />
            <bitfield caption="" mask="0x00000004" name="CNFA2" />
            <bitfield caption="" mask="0x00000008" name="CNFA3" />
            <bitfield caption="" mask="0x00000010" name="CNFA4" />
            <bitfield caption="" mask="0x00000020" name="CNFA5" />
            <bitfield caption="" mask="0x00000040" name="CNFA6" />
            <bitfield caption="" mask="0x00000080" name="CNFA7" />
            <bitfield caption="" mask="0x00000100" name="CNFA8" />
            <bitfield caption="" mask="0x00000200" name="CNFA9" />
            <bitfield caption="" mask="0x00000400" name="CNFA10" />
            <bitfield caption="" mask="0x00000800" name="CNFA11" />
            <bitfield caption="" mask="0x00001000" name="CNFA12" />
            <bitfield caption="" mask="0x00002000" name="CNFA13" />
            <bitfield caption="" mask="0x00004000" name="CNFA14" />
            <bitfield caption="" mask="0x00008000" name="CNFA15" />
         </register>
