Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/atdf/PIC32MM0256GPM064.atdf
         <register caption="" name="CNEN0C" offset="0x520" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNIE0C0" />
            <bitfield caption="" mask="0x00000002" name="CNIE0C1" />
            <bitfield caption="" mask="0x00000004" name="CNIE0C2" />
            <bitfield caption="" mask="0x00000008" name="CNIE0C3" />
            <bitfield caption="" mask="0x00000010" name="CNIE0C4" />
            <bitfield caption="" mask="0x00000020" name="CNIE0C5" />
            <bitfield caption="" mask="0x00000040" name="CNIE0C6" />
            <bitfield caption="" mask="0x00000080" name="CNIE0C7" />
            <bitfield caption="" mask="0x00000100" name="CNIE0C8" />
            <bitfield caption="" mask="0x00000200" name="CNIE0C9" />
            <bitfield caption="" mask="0x00000400" name="CNIE0C10" />
            <bitfield caption="" mask="0x00000800" name="CNIE0C11" />
            <bitfield caption="" mask="0x00001000" name="CNIE0C12" />
            <bitfield caption="" mask="0x00002000" name="CNIE0C13" />
            <bitfield caption="" mask="0x00004000" name="CNIE0C14" />
            <bitfield caption="" mask="0x00008000" name="CNIE0C15" />
         </register>
         <register caption="" name="CNSTATC" offset="0x530" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNSTATC0" />
            <bitfield caption="" mask="0x00000002" name="CNSTATC1" />
            <bitfield caption="" mask="0x00000004" name="CNSTATC2" />
            <bitfield caption="" mask="0x00000008" name="CNSTATC3" />
            <bitfield caption="" mask="0x00000010" name="CNSTATC4" />
            <bitfield caption="" mask="0x00000020" name="CNSTATC5" />
            <bitfield caption="" mask="0x00000040" name="CNSTATC6" />
            <bitfield caption="" mask="0x00000080" name="CNSTATC7" />
            <bitfield caption="" mask="0x00000100" name="CNSTATC8" />
            <bitfield caption="" mask="0x00000200" name="CNSTATC9" />
            <bitfield caption="" mask="0x00000400" name="CNSTATC10" />
            <bitfield caption="" mask="0x00000800" name="CNSTATC11" />
            <bitfield caption="" mask="0x00001000" name="CNSTATC12" />
            <bitfield caption="" mask="0x00002000" name="CNSTATC13" />
            <bitfield caption="" mask="0x00004000" name="CNSTATC14" />
            <bitfield caption="" mask="0x00008000" name="CNSTATC15" />
         </register>
         <register caption="" name="CNEN1C" offset="0x540" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNIE1C0" />
            <bitfield caption="" mask="0x00000002" name="CNIE1C1" />
            <bitfield caption="" mask="0x00000004" name="CNIE1C2" />
            <bitfield caption="" mask="0x00000008" name="CNIE1C3" />
            <bitfield caption="" mask="0x00000010" name="CNIE1C4" />
            <bitfield caption="" mask="0x00000020" name="CNIE1C5" />
            <bitfield caption="" mask="0x00000040" name="CNIE1C6" />
            <bitfield caption="" mask="0x00000080" name="CNIE1C7" />
            <bitfield caption="" mask="0x00000100" name="CNIE1C8" />
            <bitfield caption="" mask="0x00000200" name="CNIE1C9" />
            <bitfield caption="" mask="0x00000400" name="CNIE1C10" />
            <bitfield caption="" mask="0x00000800" name="CNIE1C11" />
            <bitfield caption="" mask="0x00001000" name="CNIE1C12" />
            <bitfield caption="" mask="0x00002000" name="CNIE1C13" />
            <bitfield caption="" mask="0x00004000" name="CNIE1C14" />
            <bitfield caption="" mask="0x00008000" name="CNIE1C15" />
         </register>
         <register caption="" name="CNFC" offset="0x550" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNFC0" />
            <bitfield caption="" mask="0x00000002" name="CNFC1" />
            <bitfield caption="" mask="0x00000004" name="CNFC2" />
            <bitfield caption="" mask="0x00000008" name="CNFC3" />
            <bitfield caption="" mask="0x00000010" name="CNFC4" />
            <bitfield caption="" mask="0x00000020" name="CNFC5" />
            <bitfield caption="" mask="0x00000040" name="CNFC6" />
            <bitfield caption="" mask="0x00000080" name="CNFC7" />
            <bitfield caption="" mask="0x00000100" name="CNFC8" />
            <bitfield caption="" mask="0x00000200" name="CNFC9" />
            <bitfield caption="" mask="0x00000400" name="CNFC10" />
            <bitfield caption="" mask="0x00000800" name="CNFC11" />
            <bitfield caption="" mask="0x00001000" name="CNFC12" />
            <bitfield caption="" mask="0x00002000" name="CNFC13" />
            <bitfield caption="" mask="0x00004000" name="CNFC14" />
            <bitfield caption="" mask="0x00008000" name="CNFC15" />
         </register>
         <register caption="" name="SR0C" offset="0x560" rw="R" size="4" />
         <register caption="" name="SR1C" offset="0x570" rw="R" size="4" />
         <register caption="" name="ANSELD" offset="0x5a0" rw="R" size="4" />
         <register caption="" name="TRISD" offset="0x5b0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="TRISD0" />
            <bitfield caption="" mask="0x00000002" name="TRISD1" />
            <bitfield caption="" mask="0x00000004" name="TRISD2" />
            <bitfield caption="" mask="0x00000008" name="TRISD3" />
            <bitfield caption="" mask="0x00000010" name="TRISD4" />
         </register>
         <register caption="" name="PORTD" offset="0x5c0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="RD0" />
            <bitfield caption="" mask="0x00000002" name="RD1" />
            <bitfield caption="" mask="0x00000004" name="RD2" />
            <bitfield caption="" mask="0x00000008" name="RD3" />
            <bitfield caption="" mask="0x00000010" name="RD4" />
         </register>
         <register caption="" name="LATD" offset="0x5d0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="LATD0" />
            <bitfield caption="" mask="0x00000002" name="LATD1" />
            <bitfield caption="" mask="0x00000004" name="LATD2" />
            <bitfield caption="" mask="0x00000008" name="LATD3" />
            <bitfield caption="" mask="0x00000010" name="LATD4" />
         </register>
