Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/atdf/PIC32MM0256GPM064.atdf
      <value-group caption="Timer Clock Source Select bit" name="T3CON__TCS">
         <value caption="External clock from TxCK pin" name="" value="0x1" />
         <value caption="Internal peripheral clock" name="" value="0x0" />
      </value-group>
      <value-group caption="32-Bit Timer Mode Select bit" name="T3CON__T32">
         <value caption="Odd numbered and even numbered timers form a 32-bit timer" name="" value="0x1" />
         <value caption="Odd numbered and even numbered timers form separate 16-bit timers" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits" name="T3CON__TCKPS">
         <value caption="1:256 prescale value" name="" value="0x7" />
         <value caption="1:64 prescale value" name="" value="0x6" />
         <value caption="1:32 prescale value" name="" value="0x5" />
         <value caption="1:16 prescale value" name="" value="0x4" />
         <value caption="1:8 prescale value" name="" value="0x3" />
         <value caption="1:4 prescale value" name="" value="0x2" />
         <value caption="1:2 prescale value" name="" value="0x1" />
         <value caption="1:1 prescale value" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Gated Time Accumulation Enable bit" name="T3CON__TGATE">
         <value caption="(When TCS is 1): This bit is ignored and is read as 0 / (When TCS=0): Gated time accumulation is enabled" name="" value="0x1" />
         <value caption="(When TCS is 1): This bit is ignored and is read as 0 / (When TCS=0): Gated time accumulation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="T3CON__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation even in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer On bit" name="T3CON__ON">
         <value caption="Module is enabled" name="" value="0x1" />
         <value caption="Module is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02478" name="UART" version="">
      <register-group name="UART">
         <register caption="UARTx Mode Register" name="U1MODE" offset="0x0" rw="RW" size="4">
            <bitfield caption="Stop Selection bit" mask="0x00000001" name="STSEL" values="U1MODE__STSEL" />
            <bitfield caption="Parity and Data Selection bits" mask="0x00000006" name="PDSEL" values="U1MODE__PDSEL" />
            <bitfield caption="High Baud Rate Enable bit" mask="0x00000008" name="BRGH" values="U1MODE__BRGH" />
            <bitfield caption="Receive Polarity Inversion bit" mask="0x00000010" name="RXINV" values="U1MODE__RXINV" />
            <bitfield caption="Auto-Baud Enable bit" mask="0x00000020" name="ABAUD" values="U1MODE__ABAUD" />
            <bitfield caption="UARTx Loopback Mode Select bit" mask="0x00000040" name="LPBACK" values="U1MODE__LPBACK" />
            <bitfield caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" mask="0x00000080" name="WAKE" values="U1MODE__WAKE" />
            <bitfield caption="UARTx Module Enable bits" mask="0x00000300" name="UEN" values="U1MODE__UEN" />
            <bitfield caption="Mode Selection for UxRTS Pin bit" mask="0x00000800" name="RTSMD" values="U1MODE__RTSMD" />
            <bitfield caption="IrDA  Encoder and Decoder Enable bit" mask="0x00001000" name="IREN" values="U1MODE__IREN" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="U1MODE__SIDL" />
            <bitfield caption="UARTx Enable bit" mask="0x00008000" name="ON" values="U1MODE__ON" />
            <bitfield caption="Run During Overflow Condition Mode bit" mask="0x00010000" name="RUNOVF" values="U1MODE__RUNOVF" />
            <bitfield caption="UARTx Module Clock Selection bits" mask="0x00060000" name="CLKSEL" values="U1MODE__CLKSEL" />
            <bitfield caption="UARTx Module Running Status bit" mask="0x00400000" name="ACTIVE" values="U1MODE__ACTIVE" />
            <bitfield caption="Run During Sleep Enable bit" mask="0x00800000" name="SLPEN" values="U1MODE__SLPEN" />
         </register>
         <register caption="UARTx Mode Register" name="U2MODE" offset="0x100" rw="RW" size="4">
            <bitfield caption="Stop Selection bit" mask="0x00000001" name="STSEL" values="U2MODE__STSEL" />
            <bitfield caption="Parity and Data Selection bits" mask="0x00000006" name="PDSEL" values="U2MODE__PDSEL" />
            <bitfield caption="High Baud Rate Enable bit" mask="0x00000008" name="BRGH" values="U2MODE__BRGH" />
            <bitfield caption="Receive Polarity Inversion bit" mask="0x00000010" name="RXINV" values="U2MODE__RXINV" />
            <bitfield caption="Auto-Baud Enable bit" mask="0x00000020" name="ABAUD" values="U2MODE__ABAUD" />
            <bitfield caption="UARTx Loopback Mode Select bit" mask="0x00000040" name="LPBACK" values="U2MODE__LPBACK" />
            <bitfield caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" mask="0x00000080" name="WAKE" values="U2MODE__WAKE" />
            <bitfield caption="UARTx Module Enable bits" mask="0x00000300" name="UEN" values="U2MODE__UEN" />
            <bitfield caption="Mode Selection for UxRTS Pin bit" mask="0x00000800" name="RTSMD" values="U2MODE__RTSMD" />
            <bitfield caption="IrDA  Encoder and Decoder Enable bit" mask="0x00001000" name="IREN" values="U2MODE__IREN" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="U2MODE__SIDL" />
            <bitfield caption="UARTx Enable bit" mask="0x00008000" name="ON" values="U2MODE__ON" />
            <bitfield caption="Run During Overflow Condition Mode bit" mask="0x00010000" name="RUNOVF" values="U2MODE__RUNOVF" />
            <bitfield caption="UARTx Module Clock Selection bits" mask="0x00060000" name="CLKSEL" values="U2MODE__CLKSEL" />
            <bitfield caption="UARTx Module Running Status bit" mask="0x00400000" name="ACTIVE" values="U2MODE__ACTIVE" />
            <bitfield caption="Run During Sleep Enable bit" mask="0x00800000" name="SLPEN" values="U2MODE__SLPEN" />
         </register>
         <register caption="UARTx Mode Register" name="U3MODE" offset="0x800" rw="RW" size="4">
            <bitfield caption="Stop Selection bit" mask="0x00000001" name="STSEL" values="U3MODE__STSEL" />
            <bitfield caption="Parity and Data Selection bits" mask="0x00000006" name="PDSEL" values="U3MODE__PDSEL" />
            <bitfield caption="High Baud Rate Enable bit" mask="0x00000008" name="BRGH" values="U3MODE__BRGH" />
            <bitfield caption="Receive Polarity Inversion bit" mask="0x00000010" name="RXINV" values="U3MODE__RXINV" />
            <bitfield caption="Auto-Baud Enable bit" mask="0x00000020" name="ABAUD" values="U3MODE__ABAUD" />
            <bitfield caption="UARTx Loopback Mode Select bit" mask="0x00000040" name="LPBACK" values="U3MODE__LPBACK" />
            <bitfield caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" mask="0x00000080" name="WAKE" values="U3MODE__WAKE" />
            <bitfield caption="UARTx Module Enable bits" mask="0x00000300" name="UEN" values="U3MODE__UEN" />
            <bitfield caption="Mode Selection for UxRTS Pin bit" mask="0x00000800" name="RTSMD" values="U3MODE__RTSMD" />
            <bitfield caption="IrDA  Encoder and Decoder Enable bit" mask="0x00001000" name="IREN" values="U3MODE__IREN" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="U3MODE__SIDL" />
            <bitfield caption="UARTx Enable bit" mask="0x00008000" name="ON" values="U3MODE__ON" />
            <bitfield caption="Run During Overflow Condition Mode bit" mask="0x00010000" name="RUNOVF" values="U3MODE__RUNOVF" />
            <bitfield caption="UARTx Module Clock Selection bits" mask="0x00060000" name="CLKSEL" values="U3MODE__CLKSEL" />
            <bitfield caption="UARTx Module Running Status bit" mask="0x00400000" name="ACTIVE" values="U3MODE__ACTIVE" />
            <bitfield caption="Run During Sleep Enable bit" mask="0x00800000" name="SLPEN" values="U3MODE__SLPEN" />
         </register>
         <register caption="UARTx Status and Control Register" name="U1STA" offset="0x10" rw="RW" size="4">
            <bitfield caption="Receive Buffer Data Available bit (read-only)" mask="0x00000001" name="URXDA" values="U1STA__URXDA" />
            <bitfield caption="Receive Buffer Overrun Error Status bit." mask="0x00000002" name="OERR" values="U1STA__OERR" />
            <bitfield caption="Framing Error Status bit (read-only)" mask="0x00000004" name="FERR" values="U1STA__FERR" />
            <bitfield caption="Parity Error Status bit (read-only)" mask="0x00000008" name="PERR" values="U1STA__PERR" />
            <bitfield caption="Receiver Idle bit (read-only)" mask="0x00000010" name="RIDLE" values="U1STA__RIDLE" />
            <bitfield caption="Address Character Detect bit (bit 8 of received data = 1)" mask="0x00000020" name="ADDEN" values="U1STA__ADDEN" />
            <bitfield caption="Receive Interrupt Mode Selection bit" mask="0x000000C0" name="URXISEL" values="U1STA__URXISEL" />
            <bitfield caption="Transmit Shift Register is Empty bit (read-only)" mask="0x00000100" name="TRMT" values="U1STA__TRMT" />
            <bitfield caption="Transmit Buffer Full Status bit (read-only)" mask="0x00000200" name="UTXBF" values="U1STA__UTXBF" />
            <bitfield caption="Transmit Enable bit" mask="0x00000400" name="UTXEN" values="U1STA__UTXEN" />
            <bitfield caption="Transmit Break bit" mask="0x00000800" name="UTXBRK" values="U1STA__UTXBRK" />
            <bitfield caption="Receiver Enable bit" mask="0x00001000" name="URXEN" values="U1STA__URXEN" />
            <bitfield caption="Transmit Polarity Inversion bit" mask="0x00002000" name="UTXINV" values="U1STA__UTXINV" />
            <bitfield caption="TX Interrupt Mode Selection bits" mask="0x0000C000" name="UTXISEL" values="U1STA__UTXISEL" />
            <bitfield caption="Automatic Address Mask bits" mask="0x00FF0000" name="ADDR" />
            <bitfield caption="UARTx Address Match Mask bits" mask="0xFF000000" name="MASK" values="U1STA__MASK" />
         </register>
         <register caption="UARTx Status and Control Register" name="U2STA" offset="0x110" rw="RW" size="4">
            <bitfield caption="Receive Buffer Data Available bit (read-only)" mask="0x00000001" name="URXDA" values="U2STA__URXDA" />
            <bitfield caption="Receive Buffer Overrun Error Status bit." mask="0x00000002" name="OERR" values="U2STA__OERR" />
            <bitfield caption="Framing Error Status bit (read-only)" mask="0x00000004" name="FERR" values="U2STA__FERR" />
            <bitfield caption="Parity Error Status bit (read-only)" mask="0x00000008" name="PERR" values="U2STA__PERR" />
            <bitfield caption="Receiver Idle bit (read-only)" mask="0x00000010" name="RIDLE" values="U2STA__RIDLE" />
            <bitfield caption="Address Character Detect bit (bit 8 of received data = 1)" mask="0x00000020" name="ADDEN" values="U2STA__ADDEN" />
            <bitfield caption="Receive Interrupt Mode Selection bit" mask="0x000000C0" name="URXISEL" values="U2STA__URXISEL" />
            <bitfield caption="Transmit Shift Register is Empty bit (read-only)" mask="0x00000100" name="TRMT" values="U2STA__TRMT" />
            <bitfield caption="Transmit Buffer Full Status bit (read-only)" mask="0x00000200" name="UTXBF" values="U2STA__UTXBF" />
            <bitfield caption="Transmit Enable bit" mask="0x00000400" name="UTXEN" values="U2STA__UTXEN" />
            <bitfield caption="Transmit Break bit" mask="0x00000800" name="UTXBRK" values="U2STA__UTXBRK" />
            <bitfield caption="Receiver Enable bit" mask="0x00001000" name="URXEN" values="U2STA__URXEN" />
            <bitfield caption="Transmit Polarity Inversion bit" mask="0x00002000" name="UTXINV" values="U2STA__UTXINV" />
            <bitfield caption="TX Interrupt Mode Selection bits" mask="0x0000C000" name="UTXISEL" values="U2STA__UTXISEL" />
            <bitfield caption="Automatic Address Mask bits" mask="0x00FF0000" name="ADDR" />
            <bitfield caption="UARTx Address Match Mask bits" mask="0xFF000000" name="MASK" values="U2STA__MASK" />
         </register>
